cmsis-svd/cmsis-svd/data/Atmel/ATSAME70N19.svd
            <register>
               <name>AFEC_TEMPMR</name>
               <description>AFEC Temperature Sensor Mode Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RTCT</name>
                     <description>Temperature Sensor RTC Trigger Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEMPCMPMOD</name>
                     <description>Temperature Comparison Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TEMPCMPMODSelect</name>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Generates an event when the converted data is lower than the low threshold of the window.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Generates an event when the converted data is higher than the high threshold of the window.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IN</name>
                           <description>Generates an event when the converted data is in the comparison window.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUT</name>
                           <description>Generates an event when the converted data is out of the comparison window.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEC_TEMPCWR</name>
               <description>AFEC Temperature Compare Window Register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TLOWTHRES</name>
                     <description>Temperature Low Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>THIGHTHRES</name>
                     <description>Temperature High Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEC_ACR</name>
               <description>AFEC Analog Control Register</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PGA0EN</name>
                     <description>PGA0 Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PGA1EN</name>
                     <description>PGA1 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IBCTL</name>
                     <description>AFE Bias Current Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEC_SHMR</name>
               <description>AFEC Sample &amp; Hold Mode Register</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>DUAL0</name>
                     <description>Dual Sample &amp; Hold for channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL1</name>
                     <description>Dual Sample &amp; Hold for channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL2</name>
                     <description>Dual Sample &amp; Hold for channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL3</name>
                     <description>Dual Sample &amp; Hold for channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL4</name>
                     <description>Dual Sample &amp; Hold for channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL5</name>
                     <description>Dual Sample &amp; Hold for channel 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL6</name>
                     <description>Dual Sample &amp; Hold for channel 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL7</name>
                     <description>Dual Sample &amp; Hold for channel 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL8</name>
                     <description>Dual Sample &amp; Hold for channel 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL9</name>
                     <description>Dual Sample &amp; Hold for channel 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL10</name>
                     <description>Dual Sample &amp; Hold for channel 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DUAL11</name>
                     <description>Dual Sample &amp; Hold for channel 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEC_COSR</name>
               <description>AFEC Correction Select Register</description>
               <addressOffset>0xD0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CSEL</name>
                     <description>Sample &amp; Hold unit Correction Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEC_CVR</name>
               <description>AFEC Correction Values Register</description>
               <addressOffset>0xD4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OFFSETCORR</name>
                     <description>Offset Correction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>GAINCORR</name>
                     <description>Gain Correction</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEC_CECR</name>
               <description>AFEC Channel Error Correction Register</description>
               <addressOffset>0xD8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ECORR0</name>
                     <description>Error Correction Enable for channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR1</name>
                     <description>Error Correction Enable for channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR2</name>
                     <description>Error Correction Enable for channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR3</name>
                     <description>Error Correction Enable for channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR4</name>
                     <description>Error Correction Enable for channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR5</name>
                     <description>Error Correction Enable for channel 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR6</name>
                     <description>Error Correction Enable for channel 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR7</name>
                     <description>Error Correction Enable for channel 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR8</name>
                     <description>Error Correction Enable for channel 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR9</name>
                     <description>Error Correction Enable for channel 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR10</name>
                     <description>Error Correction Enable for channel 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECORR11</name>
                     <description>Error Correction Enable for channel 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEC_WPMR</name>
               <description>AFEC Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protect KEY</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x414443</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFEC_WPSR</name>
               <description>AFEC Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protect Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protect Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
